{
  "promptTexts": [ {
    "text": "Based on your answers, I've identified patterns that point toward your professional passion. Here's what they reveal:\n\n\n\nWhat activities make you lose track of time when you're doing them?\n\n$legacy\n\n\n\nWhat abilities have consistently earned you recognition or that others seek your help with?\n\n$energy\n\n\n\nWhat principles or causes motivate you to take action, even when it's difficult?\n\n$values\n\n\n\nWhen have people consistently complimented you or asked for your help with something?\n\n$skills\n\n\n\nWhat impact would you like to be remembered for in your professional life?\n\n$legacy\n\n\n\nYour Passion Profile suggests these potential career paths:\n\n- [Career path 1 based on pattern of responses]\n\n- [Career path 2 based on pattern of responses]\n\n\n\n\n\nTo pursue this passion, consider these next steps:\n\n\n\n1. EXPLORE: Investigate these career paths through JobsForHer's resources:\n\n• Browse related job listings to understand requirements\n\n• Join professional communities in these fields\n\n• Follow industry leaders for insights\n\n\n\n2. DEVELOP: Strengthen the skills needed for success:\n\n• Identify skill gaps between your current abilities and requirements\n• Enroll in relevant workshops and training programs\n• Find mentors who excel in your areas of interest\n3. CONNECT: Build relationships that support your journey:\n\n• Attend JobsForHer networking events related to your passion\n• Join mentorship programs with professionals in your target field\n\n• Participate in community discussions to gain diverse perspectives\n\n4. EXPERIMENT: Test your passion through practical experiences:\n\n• Seek project opportunities to apply your skills\n• Volunteer for initiatives aligned with your values\n• Start small side projects to build your portfolio\n\nRemember: Finding and pursuing your passion is an evolving journey. I'm here to support you every step of the way with personalized resources and guidance from the JobsForHer community.",
    "languageCode": "en"
  } ]
}
